data/Protocols/security_token_extension_for_the_x-road_message_protocol/15_51_request.md

### 5.1 Request
```xml
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xro="http://x-road.eu/xsd/xroad.xsd"
    xmlns:iden="http://x-road.eu/xsd/identifiers"
    xmlns:prod="http://example.org/provider"
    xmlns:ext="http://x-road.eu/xsd/security-token.xsd">
    <soapenv:Header>
        <xro:protocolVersion>4.0</xro:protocolVersion>
        <xro:id>ID11234</xro:id>
        <xro:client iden:objectType="SUBSYSTEM">
            ...
        </xro:client>
        <xro:service iden:objectType="SERVICE">
            ...
            <iden:serviceCode>service</iden:serviceCode>
        </xro:service>
        <ext:securityToken tokenType="urn:ietf:params:oauth:token-type:jwt">eyJhbGciOiJIUzI1NiJ9.eyJuYW1lIjoiVGVzdCJ9.negHPJEwkKcNcgVC6dNtzPZk_48Kig6IzxnabL9jKsw</ext:securityToken>
    </soapenv:Header>
    <soapenv:Body>
        <prod:service>
            ...
        </prod:service>
    </soapenv:Body>
</soapenv:Envelope>
```